
<<<<<<< HEAD
analyze -f vhdl -lib WORK ../src/*.vhd

set power_preserve_rtl_hier_names true	

elaborate <myfir> -arch structure -lib WORK

=======
analyze -f vhdl -lib WORK ../src/.vhd

set power_preserve_rtl_hier_names true	
elaborate IIR_filter -arch structure -lib WORK
>>>>>>> 293cc19a93f5661c8a6b7317d24476e5716826e5
create_clock -name MY_CLK -period 10.0 CLK
set_dont_touch network MY_CLK
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] CLK]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set load $OLOAD [all_outputs]
<<<<<<< HEAD

=======
compile
report_timing
>>>>>>> 293cc19a93f5661c8a6b7317d24476e5716826e5

report_area > Lab_<number>_Report_Area.txt
ungroup -all -flatten
change_names -hierarchy -rules verilog
write_sdf ../netlist/<myfir>.sdf	
write -f verilog -hierarchy -output ../netlist/<myfir>.v
write_sdc ../netlist/<myfir>.sdc
<<<<<<< HEAD
quit
=======
quit
>>>>>>> 293cc19a93f5661c8a6b7317d24476e5716826e5
