analyze -f vhdl -lib WORK ../vhdl/CSA/CSA_6bit_block.vhd
analyze -f vhdl -lib WORK ../vhdl/CSA/CSA_32bit.vhd
analyze -f vhdl -lib WORK ../vhdl/CSA/Full_A.vhd
analyze -f vhdl -lib WORK ../vhdl/CSA/Mux2_1_6bit.vhd
analyze -f vhdl -lib WORK ../vhdl/CSA/RCA_6bit.vhd
analyze -f vhdl -lib WORK ../vhdl/ALU_CU.vhd
analyze -f vhdl -lib WORK ../vhdl/mod_blocks/ALU_csa.vhd
analyze -f vhdl -lib WORK ../vhdl/BranchComp.vhd
analyze -f vhdl -lib WORK ../vhdl/CU.vhd
analyze -f vhdl -lib WORK ../vhdl/ForwardUnit.vhd
analyze -f vhdl -lib WORK ../vhdl/HazardDetUnit.vhd
analyze -f vhdl -lib WORK ../vhdl/ImmGen.vhd
analyze -f vhdl -lib WORK ../vhdl/mux2to1_std.vhd
analyze -f vhdl -lib WORK ../vhdl/mux2to1_vec.vhd
analyze -f vhdl -lib WORK ../vhdl/mux4to1.vhd
analyze -f vhdl -lib WORK ../vhdl/PCInc.vhd
analyze -f vhdl -lib WORK ../vhdl/Register_PC.vhd
analyze -f vhdl -lib WORK ../vhdl/Register_std.vhd
analyze -f vhdl -lib WORK ../vhdl/Register_vec.vhd
analyze -f vhdl -lib WORK ../vhdl/RegisterFile.vhd
analyze -f vhdl -lib WORK ../vhdl/datapath.vhd
set power_preserve_rtl_hier_names true
elaborate datapath -arch structure -lib WORK
create_clock -name MY_CLK -period 1.33 clk
set_dont_touch_network MY_CLK
set_clock_uncertainty 0.07 [get_clocks MY_CLK]
set_input_delay 0.5 -max -clock MY_CLK [remove_from_collection [all_inputs] clk]
set_output_delay 0.5 -max -clock MY_CLK [all_outputs]
set OLOAD [load_of NangateOpenCellLibrary/BUF_X4/A]
set_load $OLOAD [all_outputs]
compile_ultra
report_timing
