###################################################################

# Created by write_sdc on Tue Feb 23 21:28:30 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {PCOut[31]}]
set_load -pin_load 3.40189 [get_ports {PCOut[30]}]
set_load -pin_load 3.40189 [get_ports {PCOut[29]}]
set_load -pin_load 3.40189 [get_ports {PCOut[28]}]
set_load -pin_load 3.40189 [get_ports {PCOut[27]}]
set_load -pin_load 3.40189 [get_ports {PCOut[26]}]
set_load -pin_load 3.40189 [get_ports {PCOut[25]}]
set_load -pin_load 3.40189 [get_ports {PCOut[24]}]
set_load -pin_load 3.40189 [get_ports {PCOut[23]}]
set_load -pin_load 3.40189 [get_ports {PCOut[22]}]
set_load -pin_load 3.40189 [get_ports {PCOut[21]}]
set_load -pin_load 3.40189 [get_ports {PCOut[20]}]
set_load -pin_load 3.40189 [get_ports {PCOut[19]}]
set_load -pin_load 3.40189 [get_ports {PCOut[18]}]
set_load -pin_load 3.40189 [get_ports {PCOut[17]}]
set_load -pin_load 3.40189 [get_ports {PCOut[16]}]
set_load -pin_load 3.40189 [get_ports {PCOut[15]}]
set_load -pin_load 3.40189 [get_ports {PCOut[14]}]
set_load -pin_load 3.40189 [get_ports {PCOut[13]}]
set_load -pin_load 3.40189 [get_ports {PCOut[12]}]
set_load -pin_load 3.40189 [get_ports {PCOut[11]}]
set_load -pin_load 3.40189 [get_ports {PCOut[10]}]
set_load -pin_load 3.40189 [get_ports {PCOut[9]}]
set_load -pin_load 3.40189 [get_ports {PCOut[8]}]
set_load -pin_load 3.40189 [get_ports {PCOut[7]}]
set_load -pin_load 3.40189 [get_ports {PCOut[6]}]
set_load -pin_load 3.40189 [get_ports {PCOut[5]}]
set_load -pin_load 3.40189 [get_ports {PCOut[4]}]
set_load -pin_load 3.40189 [get_ports {PCOut[3]}]
set_load -pin_load 3.40189 [get_ports {PCOut[2]}]
set_load -pin_load 3.40189 [get_ports {PCOut[1]}]
set_load -pin_load 3.40189 [get_ports {PCOut[0]}]
set_load -pin_load 3.40189 [get_ports DataMemRead]
set_load -pin_load 3.40189 [get_ports DataMemWrite]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[31]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[30]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[29]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[28]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[27]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[26]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[25]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[24]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[23]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[22]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[21]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[20]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[19]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[18]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[17]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[16]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[15]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[14]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[13]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[12]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[11]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[10]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[9]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[8]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[7]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[6]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[5]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[4]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[3]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[2]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[1]}]
set_load -pin_load 3.40189 [get_ports {DataMemAddr[0]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[31]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[30]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[29]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[28]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[27]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[26]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[25]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[24]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[23]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[22]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[21]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[20]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[19]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[18]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[17]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[16]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[15]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[14]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[13]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[12]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[11]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[10]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[9]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[8]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[7]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[6]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[5]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[4]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[3]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[2]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[1]}]
set_load -pin_load 3.40189 [get_ports {DataMemDataIn[0]}]
create_clock [get_ports clk]  -name MY_CLK  -period 1.38  -waveform {0 0.69}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Instruction[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataOut[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {PCOut[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports DataMemRead]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports DataMemWrite]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemAddr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemDataIn[0]}]
